### Pandas
* Pandas is open source library that allows to perform data manipulation(Series,DataFrames)
* Derivedd from PANel Data
### why we use pandas
* to handle missing data
* Easy way to slice the data
* flexible way to merge,concatenate,rehape data
### Data Structures in Pandas
* Series
* DataFrames

In [2]:
import pandas as pd

### Series
* It i one dimensionaal data

In [3]:
print(pd.Series([2,4,6,8]))

0    2
1    4
2    6
3    8
dtype: int64

In [4]:
print(pd.Series([2,4,6,8],index=[1,2,3,4]))

1    2
2    4
3    6
4    8
dtype: int64

In [7]:
d1=pd.Series(['vidya','civil',28,2,4],index=[1,2,3,4,5])

In [8]:
d1

1    vidya
2    civil
3       28
4        2
5        4
dtype: object

In [9]:
print(pd.Series([[1,2,3],[4,5,6]]))

0    [1, 2, 3]
1    [4, 5, 6]
dtype: object

In [13]:
print(pd.Series([1,2,3]))

0    1
1    2
2    3
dtype: int64

In [14]:
d1

1    vidya
2    civil
3       28
4        2
5        4
dtype: object

In [15]:
d1[:]

1    vidya
2    civil
3       28
4        2
5        4
dtype: object

In [16]:
d1[1:]

2    civil
3       28
4        2
5        4
dtype: object

In [17]:
d1[:4]

1    vidya
2    civil
3       28
4        2
dtype: object

In [ ]:
1 1
2 8
3 27
4 64
5 125

In [21]:
s1=pd.Series([i**3 for i in range(1,6)],index=[1,2,3,4,5])

In [22]:
s1

1      1
2      8
3     27
4     64
5    125
dtype: int64

In [24]:
n=int(input())
s=[i**3 for i in range(1,n+1)]
index=[j for j in range(1,n+1)]
pd.Series(s,index)

5

1      1
2      8
3     27
4     64
5    125
dtype: int64

## Data Frames
* Two dimensional Array

In [26]:
#using list
d1=[['vidya','28','civil'],['archana','40','cse']]
df=pd.DataFrame(d1,columns=['name','rollnumber','branch'])

In [27]:
df

      name rollnumber branch
0    vidya         28  civil
1  archana         40    cse

In [28]:
d1=[['vidya','28','civil'],['archana','40','cse']]
df=pd.DataFrame(d1,columns=['name','rollnumber','branch'],index=[1,2])

In [30]:
df

      name rollnumber branch
1    vidya         28  civil
2  archana         40    cse

In [33]:
#using dictionary
a1={'name':'vidya','clg':'gec','rollno':28}
a2={'name':'archana','clg':'PVP','rollno':40}
a3={'name':'pavani','clg':'aditya','rollno':27}
s1=pd.DataFrame([a1,a2,a3],index=[1,2,3])

In [34]:
s1

      clg     name  rollno
1     gec    vidya      28
2     PVP  archana      40
3  aditya   pavani      27

In [ ]:
d2=pd.DataFrame({//*'n'})